app/controllers/api/channels_controller.rb

SELECT "channels".* FROM "channels"
---
    def index
        @channels = Channel.all

SELECT  "channels".* FROM "channels" WHERE "channels"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
---
    def show
        @channel = Channel.find(params[:id])