app/controllers/api/channel_members_controller.rb

INSERT INTO "channel_members" ("channel_id", "member_id", "creator", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["channel_id", 1], ["member_id", 11], ["creator", false], ["created_at", "2021-11-04 22:34:19.305930"], ["updated_at", "2021-11-04 22:34:19.305930"]]
---
    def create
        @channel_member = ChannelMember.new(channel_member_params)
        if @channel_member.save