app/controllers/api/messages_controller.rb

INSERT INTO "messages" ("body", "author_id", "recipient_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["body", "hello"], ["author_id", 6], ["recipient_id", 2], ["created_at", "2021-11-01 13:09:11.102590"], ["updated_at", "2021-11-01 13:09:11.102590"]]
---
    def create
        @message = Message.new(message_params)
        if @message.save