app/controllers/api/users_controller.rb

    def index
        @users = User.search(params[:search])
---
SELECT "users".* FROM "users"

    def create
        @user = User.new(user_params)
        if @user.save
            login!(@user)
            # @channel_member = ChannelMember.create({channel_id: 120, member_id: @user.id, creator: false})
            # @channel_member.save!
            @channel_member2 = ChannelMember.create({channel_id: 130, member_id: @user.id, creator: false})
            @channel_member2.save!
---
INSERT INTO "users" ("email", "image_url", "display_name", "password_digest", "session_token", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7) RETURNING "id"
UPDATE "users" SET "session_token" = $1, "updated_at" = $2 WHERE "users"."id" = $3  [["session_token", "uOHAEH3RIz6CE1ZH8ABZ3w"], ["updated_at", "2021-10-31 16:28:08.745931"], ["id", 1]]