app/views/api/channels/show.json.jbuilder


    @channel.messages.each do |message|
---
SELECT "messages".* FROM "messages" WHERE "messages"."channel_id" = $1  [["channel_id", 1]]


    @channel.channel_members.each do |channel_member|
---
SELECT "channel_members".* FROM "channel_members" WHERE "channel_members"."channel_id" = $1  [["channel_id", 1]]