app/channels/chat_channel.rb

SELECT  "channels".* FROM "channels" WHERE "channels"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
---
  def subscribed
    @channel = Channel.find(params[:id])

INSERT INTO "messages" ("body", "author_id", "channel_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["body", "hi"], ["author_id", 12], ["channel_id", 1], ["created_at", "2021-11-05 00:25:33.609529"], ["updated_at", "2021-11-05 00:25:33.609529"]]
---
  def speak(data)
    message = Message.new(body: data['message'], author_id: data['id'], channel_id: data['channelId'])
    if message.save

SELECT "messages".* FROM "messages"
---
  def load
    filtered_messages = []
    Message.all.map{|message| filtered_messages << message if message.channel_id == @channel.id}